app/controllers/admin/comments_controller.rb

  def create

    @interview = Interview.find(params[:interview_id])

    @comment = @interview.comments.new(params[:comment])
    @comment.user = current_user

    respond_to do |format|
      if @comment.save
---
SELECT * FROM "interviews" WHERE ("interviews"."id" = 2)
INSERT INTO "comments" ("commentable_type", "updated_at", "commentable_id", "user_id", "comment", "created_at") VALUES('Interview', '2010-06-20 03:31:43', 2, 4, 'one more comment and then I''m done