app/controllers/admin/interviews_controller.rb

  def index
    @interviews = Interview.all
---
SELECT * FROM "interviews"

  def show
    @interview = Interview.find(params[:id], :include => [{:answers => :question}])
---
SELECT "answers".* FROM "answers" WHERE ("answers".interview_id = 1)
SELECT * FROM "interviews" WHERE ("interviews"."id" = 1)
SELECT * FROM "questions" WHERE ("questions"."id" IN (6,4,5))

  def destroy
    @interview = Interview.find(params[:id])
    @interview.destroy
---
SELECT * FROM "interviews" WHERE ("interviews"."id" = 2)
DELETE FROM "interviews" WHERE "id" = 2