app/controllers/admin/questions_controller.rb

  def create
    @question = Question.new(params[:question])

    #user and active cannot be set by mass assignment so set them here
    @question.user = current_user
    @question.active = true

    respond_to do |format|
      if @question.save
---
INSERT INTO "questions" ("updated_at", "question", "user_id", "active", "created_at") VALUES('2010-06-18 07:10:39', 'This is another questions', 1, 't', '2010-06-18 07:10:39')

  def destroy
    @question = Question.find(params[:id])
    @question.update_attribute(:active, false)
---
SELECT * FROM "questions" WHERE ("questions"."id" = 3)
UPDATE "questions" SET "active" = 'f', "updated_at" = '2010-06-17 06:02:35' WHERE "id" = 3