app/controllers/interviews_controller.rb

SELECT * FROM "interviews" WHERE ("interviews"."id" = 1)
---
  def show
    @interview = Interview.find(params[:id])

INSERT INTO "answers" ("answer", "updated_at", "question_id", "interview_id", "created_at") VALUES('', '2010-06-18 06:09:25', 6, 1, '2010-06-18 06:09:25')
INSERT INTO "interviews" ("name", "updated_at", "created_at") VALUES('Dale Cook', '2010-06-18 06:09:25', '2010-06-18 06:09:25')
---
  def create

    @interview = Interview.new(params[:interview])

    #for each question, assign the answer submitted
    params[:questions].each_pair do |q, v|
        @interview.answers << Answer.new(:question_id => q.to_i, :answer => v)